; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation13 - direction
	Star7 - direction
	Star1 - direction
	GroundStation11 - direction
	Star9 - direction
	Star14 - direction
	GroundStation12 - direction
	Star2 - direction
	Star6 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation4 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star7)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star10)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star10)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon18)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star9)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star14)
	(supports instrument6 infrared0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star10)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite1 Star2)
	(pointing satellite3 Planet17)
	(have_image Planet15 image1)
	(have_image Star16 infrared0)
	(have_image Planet17 infrared0)
	(have_image Phenomenon18 image1)
))

)

; plan
1. (turn_to satellite3 groundstation8 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation8)
   goals met: 0 of 7
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 7
3. (calibrate satellite3 instrument4 groundstation8)
   added: (calibrated instrument4)
   goals met: 0 of 7
4. (turn_to satellite3 planet15 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 planet15)
   goals met: 0 of 7
5. (take_image satellite3 planet15 instrument4 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 7
6. (turn_to satellite3 phenomenon18 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 phenomenon18)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation3 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 7
8. (take_image satellite3 phenomenon18 instrument4 image1)
   added: (have_image phenomenon18 image1)
   goals met: 3 of 7
9. (turn_to satellite1 star2 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star2)
   goals met: 4 of 7
10. (turn_to satellite3 star16 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 star16)
   goals met: 4 of 7
11. (take_image satellite3 star16 instrument4 infrared0)
   added: (have_image star16 infrared0)
   goals met: 5 of 7
12. (turn_to satellite3 planet17 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 planet17)
   goals met: 6 of 7
13. (take_image satellite3 planet17 instrument4 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 7 of 7
